{
  "common": {
    "experience": "Experience",
    "competence": "Competences",
    "knowledge": "Technical knowledge",
    "professionalExperience": "Professional Experience",
    "years": "Years",
    "year": "Year"
  },
  "HeroSection": {
    "title": "My name is",
    "name": "Wenderson do Nascimento Fazan",
    "description": [
      "Professional with solid experience in Web development with focus in PHP and Laravel, passionate about technology and challenges.",
      "My main professional objective is to integrate high-quality teams performance, where I have the opportunity to develop my skills and competencies, while contributing to the development of the organization through practical knowledge and theoretical knowledge acquired throughout my training.",
      "Having completed training in Internet Systems, I am always looking for new learning that can add to my area of activity, making me an increasingly qualified professional for the job market."
    ],
    "description1": "Professional with solid experience in Web development with focus in PHP and Laravel, passionate about technology and challenges.",
    "description2": "My main professional objective is to integrate high-quality teams performance, where I have the opportunity to develop my skills and competencies, while contributing to the development of the organization through practical knowledge and theoretical knowledge acquired throughout my training.",
    "description3": "Having completed training in Internet Systems, I am always looking for new learning that can add to my area of activity, making me an increasingly qualified professional for the job market."
  },
  "experiences": {
    "list": [
      {
        "company": "Pasquali Solution - CTI",
        "company_logo": "/images/pasquali_logo.png",
        "company_url": "https://www.linkedin.com/company/pasquali-solution-tech/",
        "title": "Senior Level - Developer",
        "time": "Ago/2024 - Present",
        "description": [
          "Working on refactoring the portal to modern technologies, using Laravel on the backend and Next.js on the frontend.",
          "Responsible for checking and analyzing the legacy database of the main portal, ensuring an efficient and structured migration to the new platform.",
          "Main activities:",
          "● Analysis and migration of old database to the new structure;",
          "● Refactoring and modernization of the portal using Laravel and Next.js;",
          "● Configuration and management of servers;",
          "● Implementation of mTLS for secure communication between services;",
          "● Development and maintenance of microservices to optimize scalability;",
          "● Integration of APIs, ensuring compatibility with legacy and third-party systems.",
          "Always seeking to optimize performance, security and scalability for a more efficient digital experience."
        ],
        "technologies": [
          "PHP",
          "Laravel",
          "PostgresSQL",
          "ApiRest",
          "Java",
          "Git",
          "Servers",
          "Websocket",
          "API Gateway",
          "Microservices",
          "Docker",
          "ReactJs",
          "NextJs"
        ]
      },
      {
        "company": "Acaruiy",
        "company_logo": "/images/acaruiy_logo.jpg",
        "company_url": "https://www.linkedin.com/company/acaruiy/",
        "title": "Mid Level - Developer",
        "time": "Jun/2022 - Ago/2024",
        "description": [
          "Responsible for creating and maintaining new features in the company's main product, with a focus on scalability and efficiency. Active participation in the implementation of code versioning policies, improving the organization and traceability of projects.",
          "Main activities:",
          "● Development and maintenance of features in the main product, ensuring high performance and scalability;",
          "● Implementation of code versioning policies to improve organization and traceability;",
          "● Technical support and mentoring for other developers, promoting good practices and code standardization;",
          "● Architecture and development of microservices to optimize modularization and performance of applications;",
          "● Implementation of Single Sign-On (SSO), centralizing and ensuring the security of user access;",
          "● Creation of microservices to send automated emails, optimizing notifications and communications;",
          "● Development of international APIs to facilitate integration between different systems and applications;",
          "● Automation of data flows using Apache NiFi, increasing efficiency in information processing and manipulation;",
          "● Development of an API Gateway, centralizing the management and security of corporate APIs."
        ],
        "technologies": [
          "PHP",
          "Laravel",
          "Mysql",
          "PostgresSQL",
          "ApiRest",
          "Python",
          "Java",
          "Azure",
          "Git",
          "Apache Nifi",
          "Apache Kogito",
          "Servers"
        ]
      },
      {
        "company": "Criarenet",
        "company_logo": "/images/criare_net_logo.jpg",
        "company_url": "ttps://www.linkedin.com/company/criare-net/",
        "title": "Mid Level - Developer",
        "time": "Out/2021 - Mai/2022",
        "description": [
          "I worked with the development and maintenance of portals and internal systems using current market tools such as: HTML5, CSS3, Bootstrap, JS, Jquery, AJAX, PHP and laravel.",
          "WEB solutions with laravel, integrations with REST, SOAP and XML APIs MySQL and MongoDB database maintenance."
        ],
        "technologies": [
          "PHP",
          "Laravel",
          "Docker",
          "Mysql",
          "PostgresSQL",
          "ApiRest",
          "Python",
          "Java",
          "Azure",
          "Git"
        ]
      },
      {
        "company": "Hello Soluções",
        "company_logo": "/images/hellosolucoes.jpg",
        "company_url": "https://www.linkedin.com/company/hello-solu%C3%A7%C3%B5es/",
        "title": "Developer",
        "time": "Ago/2017 - Out/2021",
        "description": [
          "I worked with the development and maintenance of portals and internal systems (intranet) using current market tools such as: HTML5, CSS3, Bootstrap, JS, Jquery, AJAX and PHP.",
          "WEB solutions with Laravel and API maintenance aimed at hotel reservations, car rental and other tourist services.",
          "MySQL and PostgreSQL database maintenance.",
          "Integrations with REST, SOAP and XML APIs."
        ],
        "technologies": [
          "HTML5",
          "CSS3",
          "Bootstrap",
          "JS",
          "Jquery",
          "AJAX",
          "PHP",
          "Laravel",
          "Docker",
          "Mysql",
          "PostgresSQL",
          "ApiRest",
          "Git"
        ]
      },
      {
        "company": "E-HTL Viagens Online",
        "company_logo": "/images/hellosolucoes.jpg",
        "company_url": "https://www.linkedin.com/company/ehtloficial/",
        "title": "Young apprentice",
        "time": "Ago/2016 - Nov/2017",
        "description": [
          "I worked with computer maintenance, help desk service, infrastructure and network maintenance."
        ],
        "technologies": [
          "infrastructure",
          "Computer maintenance",
          "Networks"
        ]
      }
    ]
  },
  "stacks": {
    "list": [
      {
        "stack": "PHP",
        "img": "php",
        "timing": "8 Years ago",
        "startDate": "2017-01-01"
      },
      {
        "stack": "Laravel",
        "img": "laravel",
        "timing": "8 Years ago",
        "startDate": "2017-01-01"
      },
      {
        "stack": "Python",
        "img": "python",
        "timing": "5 Years ago",
        "startDate": "2018-01-01"
      },
      {
        "stack": "Java",
        "timing": "4 Years ago",
        "img": "java",
        "startDate": "2021-01-01"
      },
      {
        "stack": "MySQL",
        "img": "mysql",
        "timing": "8 Years ago",
        "startDate": "2017-01-01"

      },
      {
        "stack": "Git",
        "img": "git",
        "timing": "8 Years ago",
        "startDate": "2017-01-01"

      },
      {
        "stack": "PostgresSQL",
        "img": "postgresql",
        "timing": "8 Years ago",
        "startDate": "2017-01-01"
      },
      {
        "stack": "MongoDB",
        "img": "mongodb",
        "timing": "3 Years ago",
        "startDate": "2022-01-01"
      },
      {
        "stack": "ReactJs",
        "img": "react",
        "timing": "3 Years ago",
        "startDate": "2022-01-01"
      },
      {
        "stack": "NextJs",
        "startDate": "2023-01-01",
        "img": "next",
        "timing": "3 Years ago"
      },
      {
        "stack": "NodeJS",
        "startDate": "2023-01-01",
        "img": "node",
        "timing": "2 Years ago"
      }
    ]
  },
  "workExperience": {
    "mainTitle": "As a developer with experience in PHP, Laravel, Python, Java, MySQL, other relational databases and web tools, my goal is create high quality and innovative solutions, seeking constantly improving my skills and contributing to the success of projects and development teams.",
    "description": [
      "I am a professional with 8 years of experience in web development, specializing in backend, using PHP and Python. My skills include:",
      "• Development of robust applications with PHP, using frameworks such as Laravel, in addition to Python.",
      "• Creation of frontend interfaces with HTML, CSS, JavaScript, TypeScript and ReactJS, aiming at a fluid and responsive user experience.",
      "• Proficiency in relational databases (MySQL, SQL Server, PostgreSQL) and non-relational (MongoDB), ensuring efficient and secure data management.",
      "• Implementation of RESTful and SOAP APIs, promoting efficient integration between systems.",
      "• Experience in building microservices, optimizing scalability and maintaining distributed systems.",
      "• Commitment to good programming practices and clean code, ensuring software quality and maintainability.",
      "I seek to integrate high-performance teams, where I can expand my skills and contribute significantly to the growth of the organization.",
      "I am motivated to apply as much my theoretical and practical knowledge to face challenges and drive the success of innovative projects."
    ]
  }
}