{
  "common": {
    "experience": "Experiencia",
    "competence": "Competências",
    "knowledge": "Conhecimentos",
    "professionalExperience": "Experiências profissional",
    "years": "Anos",
    "year": "Ano"
  },
  "HeroSection": {
    "title": "Meu Nome é",
    "name": "Wenderson do Nascimento Fazan",
    "description": [
      "Profissional com sólida experiência em desenvolvimento Web com foco em PHP e Laravel, apaixonado por tecnologia e desafios.",
      "Meu principal objetivo profissional é integrar equipes de alta performance, onde eu tenha a oportunidade de desenvolver minhas habilidades e competências, ao mesmo tempo em que contribuo para o desenvolvimento da organização através de conhecimentos práticos e teóricos adquiridos ao longo da minha formação.,",
      "Com formação em Sistemas para internet concluído, estou sempre em busca de novos aprendizados que possam agregar à minha área de atuação, me tornando um profissional cada vez mais capacitado para o mercado de trabalho."
    ],
    "description1": "Profissional com sólida experiência em desenvolvimento Web com foco em PHP e Laravel, apaixonado por tecnologia e desafios.",
    "description2": "Meu principal objetivo profissional é integrar equipes de alta performance, onde eu tenha a oportunidade de desenvolver minhas habilidades e competências, ao mesmo tempo em que contribuo para o desenvolvimento da organização através de conhecimentos práticos e teóricos adquiridos ao longo da minha formação.",
    "description3": "Com formação em Sistemas para internet concluído, estou sempre em busca de novos aprendizados que possam agregar à minha área de atuação, me tornando um profissional cada vez mais capacitado para o mercado de trabalho."
  },
  "experiences": {
    "list": [
      {
        "company": "Pasquali Solution - CTI",
        "company_logo": "/images/pasquali_logo.png",
        "company_url": "https://www.linkedin.com/company/pasquali-solution-tech/",
        "title": "Desenvolvedor Sênior",
        "time": "Ago/2024 - Presente",
        "description": [
          "Atuação na refatoração do portal para tecnologias modernas, utilizando Laravel no backend e Next.js no frontend.",
          "Responsável por verificar e analisar o banco de dados legado do portal principal, garantindo uma migração eficiente e estruturada para a nova plataforma.",
          "Principais atividades:",
          "● Análise e migração de banco de dados antigo para a nova estrutura;",
          "● Refatoração e modernização do portal utilizando Laravel e Next.js;",
          "● Configuração e gerenciamento de servidores;",
          "● Implementação de mTLS para comunicação segura entre serviços;",
          "● Desenvolvimento e manutenção de microserviços para otimizar a escalabilidade;",
          "● Integração de APIs, garantindo compatibilidade com sistemas legados e terceiros.",
          "Buscando sempre otimizar desempenho, segurança e escalabilidade para uma experiência digital mais eficiente."
        ],
        "technologies": [
          "PHP",
          "Laravel",
          "PostgresSQL",
          "ApiRest",
          "Java",
          "Git",
          "Servers",
          "Websocket",
          "API Gateway",
          "Microservices",
          "Docker",
          "ReactJs",
          "NextJs"
        ]
      },
      {
        "company": "Acaruiy",
        "company_logo": "/images/acaruiy_logo.jpg",
        "company_url": "https://www.linkedin.com/company/acaruiy/",
        "title": "Desenvolvedor PHP - Pleno",
        "time": "Jun/2022 - Ago/2024",
        "description": [
          "Responsável pela criação e manutenção de novas funcionalidades no principal produto da empresa, com foco em escalabilidade e eficiência. Participação ativa na implementação de políticas de versionamento de código, aprimorando a organização e rastreabilidade dos projetos.",
          "Principais atividades:",
          "● Desenvolvimento e manutenção de funcionalidades no produto principal, garantindo alta performance e escalabilidade;",
          "● Implementação de políticas de versionamento de código para melhorar a organização e rastreabilidade;",
          "● Suporte técnico e mentoria para outros desenvolvedores, promovendo boas práticas e padronização do código;",
          "● Arquitetura e desenvolvimento de microsserviços para otimização da modularização e desempenho das aplicações;",
          "● Implementação de Single Sign-On (SSO), centralizando e garantindo a segurança dos acessos dos usuários;",
          "● Criação de microsserviços para envio de e-mails automatizados, otimizando notificações e comunicações;",
          "● Desenvolvimento de APIs internacionais para facilitar a integração entre sistemas e aplicações diferentes;",
          "● Automação de fluxos de dados utilizando Apache NiFi, aumentando a eficiência no processamento e manipulação de informações;",
          "● Desenvolvimento de um API Gateway, centralizando o gerenciamento e a segurança das APIs corporativas."
        ],
        "technologies": [
          "PHP",
          "Laravel",
          "Mysql",
          "PostgresSQL",
          "ApiRest",
          "Python",
          "Java",
          "Azure",
          "Git",
          "Apache Nifi",
          "Apache Kogito",
          "Servidores"
        ]
      },
      {
        "company": "Criarenet",
        "company_logo": "/images/criare_net_logo.jpg",
        "company_url": "https://www.linkedin.com/company/criare-net/",
        "title": "Desenvolvedor PHP - Pleno",
        "time": "Out/2021 - Mai/2022",
        "description": [
          "Atuei com desenvolvimento e manutenção de portais e sistemas internos utilizando as ferramentas atuais do mercado como: HTML5, CSS3, Bootstrap, JS, Jquery, AJAX, PHP e laravel.",
          "Soluções WEB com laravel, integrações com APIs REST, SOAP e XML Manutenção de banco de dados MySQL e MongoDB."
        ],
        "technologies": [
          "PHP",
          "Laravel",
          "Docker",
          "Mysql",
          "PostgresSQL",
          "ApiRest",
          "Python",
          "Java",
          "Azure",
          "Git"
        ]
      },
      {
        "company": "Hello Soluções",
        "company_logo": "/images/hellosolucoes.jpg",
        "company_url": "https://www.linkedin.com/company/hello-solu%C3%A7%C3%B5es/",
        "title": "Desenvolvedor PHP - Jr",
        "time": "Ago/2017 - Out/2021",
        "description": [
          "Atuei com desenvolvimento e manutenção de portais e sistemas internos(intranet) utilizando as ferramentas atuais do mercado como: HTML5, CSS3, Bootstrap, JS, Jquery, AJAX e PHP.",
          "Soluções WEB com laravel e manutenções de API's voltada à reservas de hotelaria, locação de veículos entre outros serviços turísticos.",
          "Manutenção de banco de dados MySQL e PostgreSQL.",
          "Integrações com API's REST, SOAP e XML."
        ],
        "technologies": [
          "HTML5",
          "CSS3",
          "Bootstrap",
          "JS",
          "Jquery",
          "AJAX",
          "PHP",
          "Laravel",
          "Docker",
          "Mysql",
          "PostegresSQL",
          "ApiRest",
          "Git"
        ]
      },
      {
        "company": "E-HTL Viagens Online",
        "company_logo": "/images/hellosolucoes.jpg",
        "company_url": "https://www.linkedin.com/company/ehtloficial/",
        "title": "Jovem Aprendiz",
        "time": "Ago/2016 - Nov/2017",
        "description": [
          "Atuei com manutenções de computadores, atendimento help desk, infraestrutura e manutenção de redes."
        ],
        "technologies": [
          "infraestrutura",
          "Manutenção de computadores",
          "Redes"
        ]
      }
    ]
  },
  "stacks": {
    "list": [
      {
        "stack": "PHP",
        "img": "php",
        "timing": "Há 7 Anos",
        "startDate": "2017-01-01"
      },
      {
        "stack": "Laravel",
        "img": "laravel",
        "timing": "Há 7 Anos",
        "startDate": "2017-01-01"
      },
      {
        "stack": "Python",
        "img": "python",
        "timing": "Há 5 Anos",
        "startDate": "2018-01-01"
      },
      {
        "stack": "Java",
        "img": "java",
        "timing": "Há 3 Anos",
        "startDate": "2021-01-01"
      },
      {
        "stack": "MySQL",
        "img": "mysql",
        "timing": "Há 7 Anos",
        "startDate": "2017-01-01"
      },
      {
        "stack": "Git",
        "img": "git",
        "timing": "Há 7 Anos",
        "startDate": "2017-01-01"
      },
      {
        "stack": "PostgresSQL",
        "img": "postgresql",
        "timing": "Há 7 Anos",
        "startDate": "2017-01-01"
      },
      {
        "stack": "MongoDB",
        "img": "mongodb",
        "timing": "Há 3 Anos",
        "startDate": "2022-01-01"
      },
      {
        "stack": "ReactJs",
        "img": "react",
        "timing": "Há 2 Anos",
        "startDate": "2022-01-01"
      },
      {
        "stack": "NextJs",
        "img": "next",
        "timing": "Há 2 Anos",
        "startDate": "2023-01-01"
      },
      {
        "stack": "NodeJS",
        "img": "node",
        "timing": "Há 2 Anos",
        "startDate": "2023-01-01"
      }
    ]
  },
  "workExperience": {
    "mainTitle": "Como desenvolvedor com experiência em PHP, Laravel, Python, Java, MySQL, outros bancos relacionais e ferramentas web, meu objetivo é criar soluções de alta qualidade e inovadoras, buscando constantemente aprimorar minhas habilidades e contribuir para o sucesso dos projetos e equipes de desenvolvimento.",
    "description": [
      "Sou um profissional com 8 anos de experiência em desenvolvimento web, com especialização em backend, utilizando PHP e Python. Minhas competências incluem:",
      "• Desenvolvimento de aplicações robustas com PHP, empregando frameworks como Laravel, além de Python.",
      "• Criação de interfaces frontend com HTML, CSS, JavaScript, TypeScript e ReactJS, visando uma experiência de usuário fluida e responsiva.",
      "• Proficiência em bancos de dados relacionais (MySQL, SQL Server, PostgreSQL) e não relacionais (MongoDB), garantindo uma gestão eficiente e segura dos dados.",
      "• Implementação de APIs RESTful e SOAP, promovendo integração eficiente entre sistemas.",
      "• Experiência na construção de microservices, otimização da escalabilidade e manutenção de sistemas distribuídos.",
      "• Compromisso com boas práticas de programação e código limpo, assegurando a qualidade e a manutenibilidade do software.",
      "Busco integrar equipes de alto desempenho, onde possa ampliar minhas competências e contribuir significativamente para o crescimento da organização.",
      "Estou motivado a aplicar tanto meu conhecimento teórico quanto prático para enfrentar desafios e impulsionar o sucesso de projetos inovadores."
    ]
  }
}